CREATE DATABASE  IF NOT EXISTS `blacklist` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `blacklist`;
-- MySQL dump 10.13  Distrib 5.7.12, for Win64 (x86_64)
--
-- Host: localhost    Database: blacklist
-- ------------------------------------------------------
-- Server version	5.7.15-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `blacklist_client`
--

DROP TABLE IF EXISTS `blacklist_client`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `blacklist_client` (
  `client_id` int(11) NOT NULL AUTO_INCREMENT,
  `lastname` varchar(64) NOT NULL,
  `firstname` varchar(64) NOT NULL,
  `midname` varchar(64) DEFAULT NULL,
  `birthday` date NOT NULL,
  `comment` varchar(45) DEFAULT NULL,
  `created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `user_id` int(11) NOT NULL,
  PRIMARY KEY (`client_id`)
) ENGINE=InnoDB AUTO_INCREMENT=49 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `blacklist_client`
--

LOCK TABLES `blacklist_client` WRITE;
/*!40000 ALTER TABLE `blacklist_client` DISABLE KEYS */;
INSERT INTO `blacklist_client` VALUES (2,'Петров','Петр','Петрович','1900-01-23','тест','2019-01-15 12:45:46','2019-01-15 12:45:46',1),(3,'Сидоров','Иван','Алексеевич','1900-03-24','тест','2019-01-15 12:49:37','2019-01-15 15:00:42',1),(4,'Иванов','Андрей','Иванович','1987-02-22','тест','2019-01-15 15:40:49','2019-01-15 15:40:49',1),(5,'Павлов','Павел','Валентинович','1988-02-23','комментарий','2019-01-16 12:38:07','2019-01-16 12:38:07',1),(6,'Павловa','Павелa','Валентиновyf','1988-02-22','комментарий','2019-01-16 13:05:00','2019-01-16 13:05:00',1),(7,'Павa','Пa','Ва','1988-12-22','комментарий','2019-01-16 13:06:32','2019-01-16 13:06:32',1),(8,'Павввa','Пaв','Вав','1988-12-12','комментарий','2019-01-16 13:07:10','2019-01-16 13:07:10',1),(9,'Павлов','Павел','Валентинович','1988-02-23','комментарий','2019-01-16 13:12:18','2019-01-16 13:12:18',1),(10,'','','','1988-02-22','','2019-01-16 13:24:14','2019-01-16 13:24:14',1),(11,'','','','1988-02-22','','2019-01-16 13:25:27','2019-01-16 13:25:27',1),(12,'Терен','Мария','Сергеевна','1988-02-22','','2019-01-16 13:26:50','2019-01-16 13:26:50',1),(13,'','','','1988-02-22',NULL,'2019-01-16 13:32:55','2019-01-16 13:32:55',1),(14,'','','','1988-02-22','','2019-01-16 14:03:28','2019-01-16 14:03:28',1),(15,'Тест','Тест','Тест','1988-02-22','','2019-01-16 14:04:23','2019-01-16 14:04:23',1),(16,'','','','1988-02-22','','2019-01-16 14:16:55','2019-01-16 14:16:55',1),(17,'ывапывап','фвапывап','фывпфп','1988-02-22','','2019-01-16 14:21:04','2019-01-16 14:21:04',1),(18,'ывапывап','фвапывап','фывпфп','1988-02-22','','2019-01-16 14:23:17','2019-01-16 14:23:17',1),(19,'ывапывап','фвапывап','фывпфп','1988-02-22','','2019-01-16 14:23:21','2019-01-16 14:23:21',1),(20,'ывапывап','фвапывап','фывпфп','1988-02-22','','2019-01-16 14:29:17','2019-01-16 14:29:17',1),(21,'ееее','ееее','ееее','1988-02-22','','2019-01-16 14:38:48','2019-01-16 14:38:48',1),(22,'цйцуйцу','йцуйцу','цйуцйу','1988-01-11','','2019-01-16 14:40:51','2019-01-16 14:40:51',1),(23,'цйцуйцу','йцуйцу','цйуцйу','1988-01-11','','2019-01-16 14:45:05','2019-01-16 14:45:05',1),(24,'цйцуйцу','йцуйцу','цйуцйу','1988-01-11','','2019-01-16 14:45:56','2019-01-16 14:45:56',1),(25,'укенкен','укенекн','укенн','1988-12-12','','2019-01-16 14:46:14','2019-01-16 14:46:14',1),(26,'укенкен','укенекн','укенн','1988-12-12','','2019-01-16 14:48:31','2019-01-16 14:48:31',1),(27,'укенкен','укенекн','укенн','1988-12-12','','2019-01-16 14:48:46','2019-01-16 14:48:46',1),(28,'укенкен','укенекн','укенн','1988-12-12','','2019-01-16 14:50:55','2019-01-16 14:50:55',1),(29,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 15:51:39','2019-01-16 15:51:39',1),(30,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 15:53:58','2019-01-16 15:53:58',1),(31,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 15:54:50','2019-01-16 15:54:50',1),(32,'апыва','аааа','аааа','1988-12-12',NULL,'2019-01-16 16:06:17','2019-01-16 16:06:17',1),(33,'апыва','аааа','аааа','1988-12-12',NULL,'2019-01-16 16:07:10','2019-01-16 16:07:10',1),(34,'апыва','аааа','аааа','1988-12-12',NULL,'2019-01-16 16:07:18','2019-01-16 16:07:18',1),(35,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:08:02','2019-01-16 16:08:02',1),(36,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:14:38','2019-01-16 16:14:38',1),(37,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:15:46','2019-01-16 16:15:46',1),(38,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:16:22','2019-01-16 16:16:22',1),(39,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:20:06','2019-01-16 16:20:06',1),(40,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:21:43','2019-01-16 16:21:43',1),(41,'Тото','Тата','Нанп','2019-01-01',NULL,'2019-01-16 16:21:53','2019-01-16 16:21:53',1),(42,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:52:34','2019-01-16 16:52:34',1),(43,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:52:56','2019-01-16 16:52:56',1),(44,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:53:09','2019-01-16 16:53:09',1),(45,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:53:40','2019-01-16 16:53:40',1),(46,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:53:49','2019-01-16 16:53:49',1),(47,'Цим','Кит','Тит','1988-12-22',NULL,'2019-01-16 16:54:04','2019-01-16 16:54:04',1),(48,'Новый1','Новы1','Имя1','1976-12-12',NULL,'2019-01-16 16:55:02','2019-01-16 16:55:02',1);
/*!40000 ALTER TABLE `blacklist_client` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-01-16 18:38:35
